---
kind: type
id: T:Autodesk.Revit.DB.FaceDetailNode
source: html/033c07e7-4883-4998-0b2b-3b24f5e2f821.htm
---
# Autodesk.Revit.DB.FaceDetailNode

A base class of output nodes that represent face edges and face silhouettes.

## Syntax (C#)
```csharp
public class FaceDetailNode : RenderNode
```